In [1]:
#@author: Venky Rao raove@us.ibm.com
#@last edited: 13 Sep 2017
#huge thanks to Charles Gomes of IBM

# Add a .RData file to a DSX R Notebook in 5 steps

## Step 1: Uploaded your .RData file into your Object Store

In [3]:
#before you try adding the file to your notebook, the file needs to be loaded into your Object Store
#you can do this by clicking the 1001 button near the top right corner of your screen
#then you can either drop your file there or click the "browse" button to find your file and upload it
#for this notebook, I am attempting to upload the file called "Titanic.RData" which I have in my Object Store

## Step 2: Insert your Credentials

In [5]:
#the next step is to insert your credentials so that DSX can access your Object Store
#you do this by choosing a new cell in your Notebook and,
#clicking on the "Insert to code" drop down arrow that is displayed below,
#the name of the file that you want to upload

#when you click the drop down arrow, you will see a drop down list
#pick a new cell in your notebook and then click the "Insert Credentials" option

In [ ]:
# The code was removed by DSX for sharing.

## Step 3: Insert textConnectionObject

In [7]:
#the next step is to insert textConnectionObject
#you do this by choosing a new cell in your Notebook and,
#clicking on the "Insert to code" drop down arrow that is displayed below,
#the name of the file that you want to upload

#when you click the drop down arrow, you will see a drop down list
#pick a new cell in your notebook and then click the "Insert textConnectionObject" option

#after you do this, ENSURE that you make the following changes:

#REPLACE
#data <- content(httr::GET(url = access_url, add_headers ("Content-Type" = "application/json", "X-Auth-Token" = x_subject_token)), as="text")
    #textConnection(data)

#WITH
#rawdata <- content(httr::GET(url = access_url, add_headers ("Content-Type" = "application/json", "X-Auth-Token" = x_subject_token)), as="raw")
    #rawdata

#then, after the following line of code:
# Your data file was loaded into a textConnection object and you can process the data with your package of choice.
#data.1 <- getObjectStorageFileWithCredentials_2d7ac8c3aee941f7a4287c68e0f0b586("DSXTipsandTricks", "Titanic.RData")

#ADD the following line of code:

#writeBin(data.1, "Titanic.RData")

In [8]:
# The code was removed by DSX for sharing.

Loading required package: httr
Loading required package: RCurl
Loading required package: bitops

Attaching package: ‘RCurl’

The following object is masked from ‘package:SparkR’:

    base64

## Step 4: Load the .RData file

In [15]:
load(file = "Titanic.RData")

In [17]:
#check whether the file has been added to the notebook
system("ls", intern=TRUE) #invoke the UNIX shell from an R kernel and list all the files

[1] "Titanic.rdata" "Titanic.RData"

In [20]:
ls() #lists all the variables in the R workspace
     #we can see that "Titanic" is listed; this contains all our data

[1] "data.1"
[2] "getObjectStorageFileWithCredentials_2d7ac8c3aee941f7a4287c68e0f0b586"
[3] "q"
[4] "sc"
[5] "sqlContext"
[6] "Titanic"

## Step 5: Explore your dataset

In [21]:
#now we can explore our dataset as shown below:

In [22]:
head(Titanic) #lists the frst 6 rows of our dataset

  Gender Age Name                                            Fare   Class
1 Female 29  Allen, Miss. Elisabeth Walton                   211.34 Upper
2 Male    1  Allison, Master. Hudson Trevor                  151.55 Upper
3 Female  2  Allison, Miss. Helen Loraine                    151.55 Upper
4 Male   30  Allison, Mr. Hudson Joshua Creighton            151.55 Upper
5 Female 25  Allison, Mrs. Hudson J C (Bessie Waldo Daniels) 151.55 Upper
6 Male   48  Anderson, Mr. Harry                              26.55 Upper
  Survived
1 Yes
2 Yes
3 No
4 No
5 No
6 Yes

In [23]:
tail(Titanic) #lists the last 6 rows of our dataset

     Gender Age Name                                    Fare  Class Survived
1040 Female 15  Yasbeck, Mrs. Antoni (Selini Alexander) 14.45 Lower Yes
1041 Male   46  Youseff, Mr. Gerious                     7.22 Lower No
1042 Female 14  Zabour, Miss. Hileni                    14.45 Lower No
1043 Male   26  Zakarian, Mr. Mapriededer                7.22 Lower No
1044 Male   27  Zakarian, Mr. Ortin                      7.22 Lower No
1045 Male   29  Zimmerman, Mr. Leo                       7.88 Lower No

In [24]:
summary(Titanic) #provides a summary of our dataset

    Gender         Age                                      Name
 Female:388   Min.   : 0.00   Connolly, Miss. Kate            :   2
 Male  :657   1st Qu.:21.00   Kelly, Mr. James                :   2
              Median :28.00   Abbing, Mr. Anthony             :   1
              Mean   :29.84   Abbott, Master. Eugene Joseph   :   1
              3rd Qu.:39.00   Abbott, Mr. Rossmore Edward     :   1
              Max.   :80.00   Abbott, Mrs. Stanton (Rosa Hunt):   1
                              (Other)                         :1037
      Fare           Class     Survived
 Min.   :  0.00   Lower :500   No :618
 1st Qu.:  8.05   Middle:261   Yes:427
 Median : 15.75   Upper :284
 Mean   : 36.69
 3rd Qu.: 35.50
 Max.   :512.33

In [26]:
str(Titanic) #provides the structure of our dataset

'data.frame':	1045 obs. of  6 variables:
 $ Gender  : Factor w/ 2 levels "Female","Male": 1 2 1 2 1 2 1 2 1 2 ...
 $ Age     : num  29 1 2 30 25 48 63 39 53 71 ...
 $ Name    : Factor w/ 1307 levels "Abbing, Mr. Anthony",..: 22 24 25 26 27 31 46 47 51 55 ...
 $ Fare    : num  211 152 152 152 152 ...
 $ Class   : Factor w/ 3 levels "Lower","Middle",..: 3 3 3 3 3 3 3 3 3 3 ...
 $ Survived: Factor w/ 2 levels "No","Yes": 2 2 1 1 1 2 2 1 2 1 ...
 - attr(*, "na.action")=Class 'omit'  Named int [1:264] 16 38 41 47 60 70 71 75 81 107 ...
  .. ..- attr(*, "names")= chr [1:264] "16" "38" "41" "47" ...